In [1]:
import pandas as pd
import json
import numpy as np

<h2>CARGA DE DATOS</h2>
Datos Originales:   <a href="url">https://drive.google.com/drive/folders/1TI-SsMnZsNP6t930olEEWbBQdo_yuIZF</a>

In [2]:
#Carga de datasets originales
df_business = pd.read_pickle(r'C:\HENRY\PROYECTOS HENRY 11\PROYECTO GRUPAL\Datasets\business.pkl')
df_checkin = pd.read_json(r'C:\HENRY\PROYECTOS HENRY 11\PROYECTO GRUPAL\Datasets\checkin.json', lines=True)
df_tip = pd.read_json(r'C:\HENRY\PROYECTOS HENRY 11\PROYECTO GRUPAL\Datasets\tip.json', lines=True)
df_user = pd.read_parquet(r'C:\HENRY\PROYECTOS HENRY 11\PROYECTO GRUPAL\Datasets\user.parquet')

In [3]:
#Carga Dataset original review.json
chunk_size = 1000  # Número de registros a leer por cada chunk
chunks = pd.read_json(r'C:\HENRY\PROYECTOS HENRY 11\PROYECTO GRUPAL\Datasets\review.json', lines=True, chunksize=chunk_size)

df_review = pd.concat(chunks, ignore_index=True)

<h2>BUSINESS</h2>

In [4]:
#Conteo de datos
len(df_business)

150346

In [5]:
#Mostrar primeros 5 registros
df_business.head()

,business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,...,state,postal_code,latitude,longitude,stars,review_count,is_open,attributes,categories,hours
0,Pns2l4eNsfO8kk83dixA6A,"Abby Rappoport, LAC, CMQ","1616 Chapala St, Ste 2",Santa Barbara,NaN,93101,34.426679,-119.711197,5.0,7,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,mpf3x-BjTdTEA3yCZrAYPw,The UPS Store,87 Grasso Plaza Shopping Center,Affton,NaN,63123,38.551126,-90.335695,3.0,15,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,tUFrWirKiKi_TAnsVWINQQ,Target,5255 E Broadway Blvd,Tucson,NaN,85711,32.223236,-110.880452,3.5,22,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MTSW4McQd7CbVtyjqoe9mw,St Honore Pastries,935 Race St,Philadelphia,CA,19107,39.955505,-75.155564,4.0,80,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,mWMc6_wTdE0EUBKIGXDVfA,Perkiomen Valley Brewery,101 Walnut St,Green Lane,MO,18054,40.338183,-75.471659,4.5,13,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
#Conteo de columnas duplicadas
df_business.columns.duplicated().sum()

np.int64(14)

In [7]:
len(df_business.columns)

28

In [8]:
# Eliminar columnas duplicadas 
df_business = df_business.loc[:, ~df_business.columns.duplicated()]

In [9]:
df_business.columns

Index(['business_id', 'name', 'address', 'city', 'state', 'postal_code',
       'latitude', 'longitude', 'stars', 'review_count', 'is_open',
       'attributes', 'categories', 'hours'],
      dtype='object')

In [10]:
#El cliente está interesado expandir sus negocios de Coffe & Tea y Breakfast & Brunch

df_coffe = df_business[df_business['categories'].str.contains('Coffee & Tea', case=False, na=False)]
df_breakfast = df_business[df_business['categories'].str.contains('Breakfast & Brunch', case=False, na=False)]

In [12]:
# Contar la cantidad de Coffee & Tea por ciudad 
coffe_counts = df_coffe['city'].value_counts()
coffe_counts = coffe_counts.head(10)
coffe_counts = pd.DataFrame(coffe_counts).reset_index()
coffe_counts = pd.DataFrame(coffe_counts)
coffe_counts.columns = ['City', 'Count']
coffe_counts

           City  Count
0  Philadelphia    894
1         Tampa    395
2      Edmonton    350
3   New Orleans    318
4        Tucson    317
5     Nashville    310
6  Indianapolis    300
7          Reno    215
8   Saint Louis    142
9         Boise    138

In [13]:
# Contar la cantidad de Breakfast & Brunch por ciudad 
breakfast_counts = df_breakfast['city'].value_counts()
breakfast_counts = breakfast_counts.head(10)
breakfast_counts = pd.DataFrame(breakfast_counts).reset_index()
breakfast_counts = pd.DataFrame(breakfast_counts)
breakfast_counts.columns = ['City', 'Count']
breakfast_counts

            City  Count
0   Philadelphia    686
1    New Orleans    367
2      Nashville    349
3   Indianapolis    337
4          Tampa    332
5         Tucson    300
6       Edmonton    185
7           Reno    178
8    Saint Louis    177
9  Santa Barbara    119

In [14]:
#Concatenar los resultados de los dos filtros
df_coffe_break = pd.concat([df_coffe, df_breakfast])

In [21]:
df_coffe_break.shape

(12943, 14)

Limpiar el Dataset

In [16]:
df_coffe_break.head(2)

,business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open,attributes,categories,hours
3,MTSW4McQd7CbVtyjqoe9mw,St Honore Pastries,935 Race St,Philadelphia,CA,19107,39.955505,-75.155564,4.0,80,1,"{'RestaurantsDelivery': 'False', 'OutdoorSeati...","Restaurants, Food, Bubble Tea, Coffee & Tea, B...","{'Monday': '7:0-20:0', 'Tuesday': '7:0-20:0', ..."
20,WKMJwqnfZKsAae75RMP6jA,Roast Coffeehouse and Wine Bar,10359 104 Street NW,Edmonton,LA,T5J 1B9,53.546045,-113.499169,4.0,40,0,"{'OutdoorSeating': 'False', 'Caters': 'True', ...","Coffee & Tea, Food, Cafes, Bars, Wine Bars, Re...","{'Monday': '8:0-18:0', 'Tuesday': '8:0-18:0', ..."

In [17]:
df_coffe_break.isnull().sum()

business_id       0
name              0
address           0
city              0
state             0
postal_code       0
latitude          0
longitude         0
stars             0
review_count      0
is_open           0
attributes      104
categories        0
hours           830
dtype: int64

In [ ]:
#Calcular duplicados
#  Convertir los valores de tipo dict en columnas a cadenas JSON
for column in df_coffe_break.columns:
    if df_coffe_break[column].apply(lambda x: isinstance(x, dict)).any():
        df_coffe_break[column] = df_coffe_break[column].apply(json.dumps)

# Verificar duplicados
df_coffe_break.duplicated().sum()

np.int64(1185)

In [24]:
# Eliminar duplicados
df_coffe_break = df_coffe_break.drop_duplicates()

# Verificar el DataFrame resultante
print(len(df_coffe_break))

11758

In [25]:
df_coffe_break.columns

Index(['business_id', 'name', 'address', 'city', 'state', 'postal_code',
       'latitude', 'longitude', 'stars', 'review_count', 'is_open',
       'attributes', 'categories', 'hours'],
      dtype='object')

In [ ]:
#Exportar Datos
#df_coffe_break.to_json('df_business_coffe.json', orient='records', lines=True)

In [27]:
df_coffe_break.describe()

,business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open,attributes,categories,hours
count,11758,11758,11758,11758,11758,11758,11758.00000,11758.00000,11758.0,11758,11758,11758,11758,11758
unique,11758,7107,10961,616,15,1207,11554.00000,11520.00000,9.0,747,2,11440,8099,5925
top,BIyT7Kr7tMJqlfp4oOOYQg,Starbucks,,Philadelphia,PA,70130,39.91462,-86.11124,4.0,5,1,null,"Food, Coffee & Tea","{""Monday"": ""0:0-0:0"", ""Tuesday"": ""0:0-0:0"", ""W..."
freq,1,724,28,1407,2686,169,5.00000,5.00000,2831.0,450,8562,101,508,1180

<h2>CHECKIN</h2>

In [28]:
df_checkin.columns

Index(['business_id', 'date'], dtype='object')

In [32]:
df_checkin.shape

(131930, 2)

In [33]:
df_checkin.head(2)

              business_id                                               date
0  ---kPU91CF4Lq2-WlRu9Lw  2020-03-13 21:10:56, 2020-06-02 22:18:06, 2020...
1  --0iUa4sNDFiZFrAdIWhZQ  2010-09-13 21:43:09, 2011-05-04 23:08:15, 2011...

In [34]:
#Depurar
# Filtrar df_checkin solo con IDs presentes en df_coffe_break
df_checkinX = df_checkin[df_checkin['business_id'].isin(df_coffe_break['business_id'])]
# Verificar los resultados 
print(df_checkinX)

                   business_id  \
3       --7PUidqRWpRSpXebiyxTg
24      --epgcb7xHGuJ-4PUeSLAw
41      -09Oc2D14vRnmirPh0vlXw
50      -0TffRSXXIlBYVbb5AwfTg
56      -0epFLgYq2C1Jo_W4FOBKw
...                        ...
131881  zyMkbavgHASQtqVwaock9A
131884  zyPz0xvE5XkeCVH2J7g2gw
131917  zzXRdzrVhfNWPHD2MeyWeA
131920  zzfj1-iPfw0cwnOjY0yUgA
131925  zznJox6-nmXlGYNWgTDwQQ

                                                     date
3       2011-02-15 17:12:00, 2011-07-28 02:46:10, 2012...
24      2010-10-01 16:31:41, 2010-12-16 19:13:47, 2011...
41      2010-08-15 23:21:39, 2010-08-15 23:27:33, 2010...
50      2013-05-31 23:03:18, 2013-05-31 23:05:01, 2013...
56      2011-08-04 17:35:48, 2012-08-25 16:36:07, 2012...
...                                                   ...
131881  2011-03-01 18:37:14, 2011-03-17 16:57:42, 2011...
131884  2017-08-16 20:14:36, 2017-09-30 00:17:34, 2017...
131917  2019-06-28 23:00:57, 2019-07-12 23:55:18, 2019...
131920  2015-07-26 17:15:58, 2015-10-01 16:30:40, 2016...
131925  2013-03-23 16:22:47, 2013-04-07 02:03:12, 2013...

[11657 rows x 2 columns]

In [35]:
df_checkinX.duplicated().sum()

np.int64(0)

In [37]:
df_checkinX.isnull().sum()

business_id    0
date           0
dtype: int64

In [38]:
#Exportar Datos
df_checkinX.to_parquet('df_checkin_coffe.parquet', engine='pyarrow')

<h2>REVIEW</h2>

In [39]:
df_review.head(2)

,review_id,user_id,business_id,stars,useful,funny,cool,text,date
0,KU_O5udG6zpxOg-VcAEodg,mh_-eMZ6K5RLWhZyISBhwA,XQfwVwDr-v0ZS3_CbbE5Xw,3,0,0,0,"If you decide to eat here, just be aware it is...",2018-07-07 22:09:11
1,BiTunyQ73aT9WBnpR9DZGw,OyoGAe7OKpv6SyGZT5g77Q,7ATYjTIgM3jUlt4UM3IypQ,5,1,0,1,I've taken a lot of spin classes over the year...,2012-01-03 15:28:18

In [44]:
df_review.shape

(6990280, 9)

In [40]:
df_review.columns

Index(['review_id', 'user_id', 'business_id', 'stars', 'useful', 'funny',
       'cool', 'text', 'date'],
      dtype='object')

In [42]:
df_review.isnull().sum()

review_id      0
user_id        0
business_id    0
stars          0
useful         0
funny          0
cool           0
text           0
date           0
dtype: int64

In [43]:
df_review.duplicated().sum()

np.int64(0)

In [45]:
#Depurar
# Filtrar los resultados de df_coffe_break con df_review basados en business_id 
df_reviewX = df_review[df_review['business_id'].isin(df_coffe_break['business_id'])] 
# Verificar los resultados 
print(df_reviewX.head())

                 review_id                 user_id             business_id  \
0   KU_O5udG6zpxOg-VcAEodg  mh_-eMZ6K5RLWhZyISBhwA  XQfwVwDr-v0ZS3_CbbE5Xw
2   saUsX_uimxRlCVr67Z4Jig  8g_iMtfSiwikVnbP2etR0A  YjUWPpI6HXG530lwP-fb2A
11  l3Wk_mvAog6XANIuGQ9C7Q  ZbqSHbgCjzVAqaa7NKWn5A  EQ-TZ2eeD_E0BHuvoaeG5Q
14  UBp0zWyH60Hmw6Fsasei7w  4Uh27DgGzsp6PqrH913giQ  otQS34_MymijPTdNBoBdCw
15  OAhBYw8IQ6wlfw1owXWRWw  1C2lxzUo1Hyye4RFIXly3g  BVndHaLihEYbr76Z0CMEGw

    stars  useful  funny  cool  \
0       3       0      0     0
2       3       0      0     0
11      4       0      0     0
14      4       0      2     0
15      5       0      0     0

                                                 text                date
0   If you decide to eat here, just be aware it is... 2018-07-07 22:09:11
2   Family diner. Had the buffet. Eclectic assortm... 2014-02-05 20:30:30
11  Locals recommended Milktooth, and it's an amaz... 2015-08-19 14:31:45
14  The bun makes the Sonoran Dog. It's like a snu... 2011-10-27 17:12:05
15  Great place for breakfast! I had the waffle, w... 2014-10-11 16:22:06

In [46]:
df_reviewX.shape

(1147469, 9)

In [47]:
df_reviewX.columns

Index(['review_id', 'user_id', 'business_id', 'stars', 'useful', 'funny',
       'cool', 'text', 'date'],
      dtype='object')

In [ ]:
#Exportar Datos
#df_reviewX.to_parquet('df_review_coffe.parquet', engine='pyarrow')

<h2>TIP</h2>

In [49]:
df_tip.columns

Index(['user_id', 'business_id', 'text', 'date', 'compliment_count'], dtype='object')

In [51]:
df_tip.shape

(908915, 5)

In [52]:
df_tip.head()

,user_id,business_id,text,date,compliment_count
0,AGNUgVwnZUey3gcPCJ76iw,3uLgwr0qeCNMjKenHJwPGQ,Avengers time with the ladies.,2012-05-18 02:17:21,0
1,NBN4MgHP9D3cw--SnauTkA,QoezRbYQncpRqyrLH6Iqjg,They have lots of good deserts and tasty cuban...,2013-02-05 18:35:10,0
2,-copOvldyKh1qr-vzkDEvw,MYoRNLb5chwjQe3c_k37Gg,It's open even when you think it isn't,2013-08-18 00:56:08,0
3,FjMQVZjSqY8syIO-53KFKw,hV-bABTK-glh5wj31ps_Jw,Very decent fried chicken,2017-06-27 23:05:38,0
4,ld0AperBXk1h6UbqmM80zw,_uN0OudeJ3Zl_tf6nxg5ww,Appetizers.. platter special for lunch,2012-10-06 19:43:09,0

In [53]:
df_tip.isnull().sum()

user_id             0
business_id         0
text                0
date                0
compliment_count    0
dtype: int64

In [54]:
df_tip.duplicated().sum()

np.int64(67)

In [56]:
df_tip.shape

(908915, 5)

In [57]:
df_tip = df_tip.drop_duplicates()
df_tip.shape

(908848, 5)

In [58]:
#Depurar
# Combinar los DataFrames df_tip y df_coffe_break basados en business_id 
df_tipX = df_tip[df_tip['business_id'].isin(df_coffe_break['business_id'])] 
# Verificar los resultados 
print(df_tipX.head())

                   user_id             business_id  \
1   NBN4MgHP9D3cw--SnauTkA  QoezRbYQncpRqyrLH6Iqjg
5   trf3Qcz8qvCDKXiTgjUcEg  7Rm9Ba50bw23KTA8RedZYg
9   4ay-fdVks5WMerYL_htkGQ  pICJRcyqW1cF96Q3XhLSbw
12  Y0JfJh4B-jrtGc_AHfWi6w  wUMuvdUeVZODZk7TjaD2jg
14  ffWWVlmsrN5lZ6sjAE-vTw  aK6R2akvIK9ijw3FvDy8vw

                                                 text                date  \
1   They have lots of good deserts and tasty cuban... 2013-02-05 18:35:10
5   Chili Cup + Single Cheeseburger with onion, pi... 2012-03-13 04:00:52
9   Starbucks substitute in boring downtown Tampa.... 2012-06-09 22:57:04
12            If the Hotlight is on you must stop in. 2013-02-28 02:05:54
14         Basically same food as rally's for $5 more 2014-06-12 17:34:20

    compliment_count
1                  0
5                  0
9                  0
12                 0
14                 0

In [60]:
df_tipX.shape

(164564, 5)

In [61]:
#Exportar Datos
df_tipX.to_parquet('df_tip_coffe.parquet', engine='pyarrow')

<h2>USER</h2>

In [62]:
df_user.columns

Index(['user_id', 'name', 'review_count', 'yelping_since', 'useful', 'funny',
       'cool', 'elite', 'friends', 'fans', 'average_stars', 'compliment_hot',
       'compliment_more', 'compliment_profile', 'compliment_cute',
       'compliment_list', 'compliment_note', 'compliment_plain',
       'compliment_cool', 'compliment_funny', 'compliment_writer',
       'compliment_photos'],
      dtype='object')

In [80]:
df_user.head(5)

,user_id,name,review_count,yelping_since,useful,funny,cool,elite,friends,fans,...,compliment_more,compliment_profile,compliment_cute,compliment_list,compliment_note,compliment_plain,compliment_cool,compliment_funny,compliment_writer,compliment_photos
0,qVc8ODYU5SZjKXVBgXdI7w,Walker,585,2007-01-25 16:47:26,7217,1259,5994,2007,"NSCy54eWehBJyZdG2iE84w, pe42u7DcCH2QmI81NX-8qA...",267,...,65,55,56,18,232,844,467,467,239,180
1,j14WgRoU_-2ZE1aw1dXrJg,Daniel,4333,2009-01-25 04:35:42,43091,13066,27281,"2009,2010,2011,2012,2013,2014,2015,2016,2017,2...","ueRPE0CX75ePGMqOFVj6IQ, 52oH4DrRvzzl8wh5UXyU0A...",3138,...,264,184,157,251,1847,7054,3131,3131,1521,1946
2,2WnXYQFK0hXEoTxPtV2zvg,Steph,665,2008-07-25 10:41:00,2086,1010,1003,"2009,2010,2011,2012,2013","LuO3Bn4f3rlhyHIaNfTlnA, j9B4XdHUhDfTKVecyWQgyA...",52,...,13,10,17,3,66,96,119,119,35,18
3,SZDeASXq7o05mMNLshsdIA,Gwen,224,2005-11-29 04:38:33,512,330,299,"2009,2010,2011","enx1vVPnfdNUdPho6PH_wg, 4wOcvMLtU6a9Lslggq74Vg...",28,...,4,1,6,2,12,16,26,26,10,9
4,hA5lMy-EnncsH4JoR-hFGQ,Karen,79,2007-01-05 19:40:59,29,15,7,,"PBK4q9KEEBHhFvSXCUirIw, 3FWPpM7KU1gXeOM_ZbYMbA...",1,...,1,0,0,0,1,1,0,0,0,0

In [81]:
df_user.isnull().sum()

user_id               0
name                  0
review_count          0
yelping_since         0
useful                0
funny                 0
cool                  0
elite                 0
friends               0
fans                  0
average_stars         0
compliment_hot        0
compliment_more       0
compliment_profile    0
compliment_cute       0
compliment_list       0
compliment_note       0
compliment_plain      0
compliment_cool       0
compliment_funny      0
compliment_writer     0
compliment_photos     0
dtype: int64

In [82]:
df_user.duplicated().sum()

np.int64(0)

In [67]:
df_user.shape

(2105597, 22)

In [68]:
#Eliminar los duplicados
df_user.drop_duplicates(inplace=True)
df_user.shape

(1987897, 22)

In [83]:
df_reviewX.columns

Index(['review_id', 'user_id', 'business_id', 'stars', 'useful', 'funny',
       'cool', 'text', 'date'],
      dtype='object')

In [84]:
#Depurar
# Combinar los DataFrames df_user y df_reviewx basados en user_id 
df_userX = df_user[df_user['user_id'].isin(df_reviewX['user_id'])] 
# Verificar los resultados 
print(df_userX.head())

                  user_id    name  review_count        yelping_since  useful  \
0  qVc8ODYU5SZjKXVBgXdI7w  Walker           585  2007-01-25 16:47:26    7217
1  j14WgRoU_-2ZE1aw1dXrJg  Daniel          4333  2009-01-25 04:35:42   43091
2  2WnXYQFK0hXEoTxPtV2zvg   Steph           665  2008-07-25 10:41:00    2086
3  SZDeASXq7o05mMNLshsdIA    Gwen           224  2005-11-29 04:38:33     512
4  hA5lMy-EnncsH4JoR-hFGQ   Karen            79  2007-01-05 19:40:59      29

   funny   cool                                              elite  \
0   1259   5994                                               2007
1  13066  27281  2009,2010,2011,2012,2013,2014,2015,2016,2017,2...
2   1010   1003                           2009,2010,2011,2012,2013
3    330    299                                     2009,2010,2011
4     15      7

                                             friends  fans  ...  \
0  NSCy54eWehBJyZdG2iE84w, pe42u7DcCH2QmI81NX-8qA...   267  ...
1  ueRPE0CX75ePGMqOFVj6IQ, 52oH4DrRvzzl8wh5UXyU0A...  3138  ...
2  LuO3Bn4f3rlhyHIaNfTlnA, j9B4XdHUhDfTKVecyWQgyA...    52  ...
3  enx1vVPnfdNUdPho6PH_wg, 4wOcvMLtU6a9Lslggq74Vg...    28  ...
4  PBK4q9KEEBHhFvSXCUirIw, 3FWPpM7KU1gXeOM_ZbYMbA...     1  ...

   compliment_more  compliment_profile  compliment_cute  compliment_list  \
0               65                  55               56               18
1              264                 184              157              251
2               13                  10               17                3
3                4                   1                6                2
4                1                   0                0                0

   compliment_note  compliment_plain  compliment_cool  compliment_funny  \
0              232               844              467               467
1             1847              7054             3131              3131
2               66                96              119               119
3               12                16               26                26
4                1                 1                0                 0

   compliment_writer  compliment_photos
0                239                180
1               1521               1946
2                 35                 18
3                 10                  9
4                  0                  0

[5 rows x 22 columns]

In [85]:
df_userX.duplicated().sum()

np.int64(0)

In [86]:
df_userX.shape

(574223, 22)

In [87]:
df_userX.columns

Index(['user_id', 'name', 'review_count', 'yelping_since', 'useful', 'funny',
       'cool', 'elite', 'friends', 'fans', 'average_stars', 'compliment_hot',
       'compliment_more', 'compliment_profile', 'compliment_cute',
       'compliment_list', 'compliment_note', 'compliment_plain',
       'compliment_cool', 'compliment_funny', 'compliment_writer',
       'compliment_photos'],
      dtype='object')

In [89]:
df_userX = df_userX.drop(columns=['yelping_since', 'friends', 'elite'])

In [91]:
df_userX.columns

Index(['user_id', 'name', 'review_count', 'useful', 'funny', 'cool', 'fans',
       'average_stars', 'compliment_hot', 'compliment_more',
       'compliment_profile', 'compliment_cute', 'compliment_list',
       'compliment_note', 'compliment_plain', 'compliment_cool',
       'compliment_funny', 'compliment_writer', 'compliment_photos'],
      dtype='object')

In [92]:
df_userX.shape

(574223, 19)

In [ ]:
#Exportar Datos
#df_userX.to_parquet('df_user_coffe.parquet', engine='pyarrow')